Revit 2015 API
Pipe.Create Method (Document, ElementId, ElementId, ElementId, XYZ, XYZ)
 Creates a new pipe from two points.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
public static Pipe Create(
	Document document,
	ElementId systemTypeId,
	ElementId pipeTypeId,
	ElementId levelId,
	XYZ startPoint,
	XYZ endPoint
)
Visual Basic
Public Shared Function Create ( _
	document As Document, _
	systemTypeId As ElementId, _
	pipeTypeId As ElementId, _
	levelId As ElementId, _
	startPoint As XYZ, _
	endPoint As XYZ _
) As Pipe
Visual C++
public:
static Pipe^ Create(
	Document^ document,
	ElementId^ systemTypeId,
	ElementId^ pipeTypeId,
	ElementId^ levelId,
	XYZ^ startPoint,
	XYZ^ endPoint
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
systemTypeId
Type: Autodesk.Revit.DB.ElementId
 The ElementId of the piping system type.
pipeTypeId
Type: Autodesk.Revit.DB.ElementId
 The ElementId of the pipe type.
levelId
Type: Autodesk.Revit.DB.ElementId
 The level ElementId for the pipe.
startPoint
Type: Autodesk.Revit.DB.XYZ
 The start point of the pipe.
endPoint
Type: Autodesk.Revit.DB.XYZ
 The end point of the pipe.
Return Value
 The pipe.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The systemTypeId is not valid piping system type. -or- The pipe type pipeTypeId is not valid pipe type. -or- The level id levelId is not valid. -or- The points of startPoint and endPoint are equal.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Mechanical Electrical Piping.
See Also
Pipe Class
Create Overload
Autodesk.Revit.DB.Plumbing Namespace